In [1]:
import numpy as np
import pandas as pd

In [2]:
sozluk1 = {"Isim" :["Ahmet","Mehmet","Atil","Zeynep"],
          "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"],
          "Kalori" : [100,200,300,400]}

In [3]:
dataframe1 = pd.DataFrame(sozluk1)

In [4]:
dataframe1

     Isim       Spor  Kalori
0   Ahmet       Kosu     100
1  Mehmet      Yüzme     200
2    Atil       Kosu     300
3  Zeynep  Basketbol     400

In [13]:
sozluk2 = {"Isim" :["Asli","Burak","Eda","Ezgi"],
          "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"],
          "Kalori" : [250,50,450,140]}

In [14]:
dataframe2 = pd.DataFrame(sozluk2,index = [4,5,6,7])

In [15]:
sozluk3 = {"Isim" :["Ayse","Fatma","Fatih","Nur"],
          "Spor" : ["Koşu","Yüzme","Badminton","Basketbol"],
          "Kalori" : [75,150,140,180]}

In [16]:
dataframe3 = pd.DataFrame(sozluk3,index = [8,9,10,11])

In [17]:
dataframe2

    Isim       Spor  Kalori
4   Asli       Koşu     250
5  Burak      Yüzme      50
6    Eda       Koşu     450
7   Ezgi  Basketbol     140

In [18]:
dataframe3

     Isim       Spor  Kalori
8    Ayse       Koşu      75
9   Fatma      Yüzme     150
10  Fatih  Badminton     140
11    Nur  Basketbol     180

# Birleştirme

In [21]:
pd.concat([dataframe1,dataframe2,dataframe3],axis = 0)

      Isim       Spor  Kalori
0    Ahmet       Kosu     100
1   Mehmet      Yüzme     200
2     Atil       Kosu     300
3   Zeynep  Basketbol     400
4     Asli       Koşu     250
5    Burak      Yüzme      50
6      Eda       Koşu     450
7     Ezgi  Basketbol     140
8     Ayse       Koşu      75
9    Fatma      Yüzme     150
10   Fatih  Badminton     140
11     Nur  Basketbol     180

# merge(kaynaştırmak)

In [22]:
mergesozluk1 = { "Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
               "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"]}

In [23]:
mergedataframe1 = pd.DataFrame(mergesozluk1)

In [24]:
mergesozluk2 = { "Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
               "Kalori" : [100,200,150,300]}

In [25]:
mergedataframe2 = pd.DataFrame(mergesozluk2)

In [27]:
mergedataframe1

     Isim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

In [28]:
mergedataframe1

     Isim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

In [29]:
pd.merge(mergedataframe1,mergedataframe2, on = "Isim")

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     150
3    Atıl  Basketbol     300

In [30]:
maassozluk = { "Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
               "Departman" : ["Yazılım","Satış","Pazarlama","Yazılım"],
               "Maas" : [2000,3200,2500,2700]}

In [31]:
maasdataframe = pd.DataFrame(maassozluk)

In [35]:
maasdataframe

     Isim  Departman  Maas
0   Ahmet    Yazılım  2000
1  Mehmet      Satış  3200
2  Zeynep  Pazarlama  2500
3    Atıl    Yazılım  2700

In [37]:
maasdataframe["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [38]:
maasdataframe["Departman"].nunique()

3

In [39]:
maasdataframe["Departman"].value_counts()

Yazılım      2
Satış        1
Pazarlama    1
Name: Departman, dtype: int64

In [47]:
def buruttennete(maas):
    return maas * 0.66

In [48]:
maasdataframe["Maas"].apply(buruttennete)

0    1320.0
1    2112.0
2    1650.0
3    1782.0
Name: Maas, dtype: float64

In [49]:
maasdataframe.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [50]:
yeniveri = {"Karakter sınıfı" : ["South","South","Simpson","Simpson"],
           "Karakter ismi" : ["Cartman","Kenny","Homer","Bart"],
           "Karakter yaş" : [9,13,11,15]}

In [51]:
karakterDF = pd.DataFrame(yeniveri)

In [52]:
karakterDF

  Karakter sınıfı Karakter ismi  Karakter yaş
0           South       Cartman             9
1           South         Kenny            13
2         Simpson         Homer            11
3         Simpson          Bart            15

In [53]:
karakterDF.pivot_table(values = "Karakter yaş",index =["Karakter sınıfı","Karakter ismi"])

                               Karakter yaş
Karakter sınıfı Karakter ismi
Simpson         Bart                     15
                Homer                    11
South           Cartman                   9
                Kenny                    13